Tekla Open API Reference for Tekla Structures 2025
ClipPlane Constructor
Initializes a new instance of the ClipPlane class.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ClipPlane()
Public Sub New
See Also
Reference
ClipPlane Class
Tekla.Structures.Model.UI Namespace